app/Controllers/ActivityLogController.php

SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
---
        }

        $data['logs'] = $builder->findAll();
        $data['users'] = $this->userModel->findAll();