app/Controllers/BranchController.php

    public function update($id)
    {
        $session = session();
        if (!$session->get('isLoggedIn')) {
            return redirect()->to('/login');
        }

        // Only system_admin and central_admin can update branches
        if (!$this->checkRoleAccess(['system_admin', 'central_admin'])) {
            return $this->unauthorized('Only administrators can update branches');
        }

        $data = [
            'name' => $this->request->getPost('name'),
            'code' => $this->request->getPost('code'),
            'address' => $this->request->getPost('address'),
            'city' => $this->request->getPost('city'),
            'phone' => $this->request->getPost('phone'),
            'email' => $this->request->getPost('email'),
            'manager_id' => $this->request->getPost('manager_id'),
            'status' => $this->request->getPost('status'),
            'is_franchise' => $this->request->getPost('is_franchise') ? 1 : 0,
        ];

        if ($this->branchModel->update($id, $data)) {
---
UPDATE `branches` SET `name` = 'MALAPATAN CHAKANOK', `code` = 'MALAPATAN', `address` = 'Malapatan Poblacion', `city` = 'Sarangani', `phone` = '09131232131', `email` = 'Malapatan@gmail.com', `manager_id` = '2', `status` = 'active', `is_franchise` = 0, `updated_at` = '2025-12-10 15:10:53'
WHERE `branches`.`id` IN ('1')