app/Controllers/DashboardController.php


            case 'branch_manager':
                // Get branch info
                $branch = (new BranchModel())->find($branchId);
                $data['branch_name'] = $branch['name'] ?? 'Your Branch';
                $data['branch_info'] = $branch;

                $data['branch_inventory'] = (new InventoryModel())->where('branch_id', $branchId)->countAllResults();
---
SELECT *
FROM `branches`
WHERE `branches`.`id` = '4'
SELECT COUNT(*) AS `numrows`
FROM `inventory`
WHERE `branch_id` = '4'

                $data['low_stock_items'] = count($lowStockItems);
                $data['low_stock_count'] = count($lowStockItems);
                $data['low_stock_list'] = $lowStockItems;
                $data['pending_requests'] = (new PurchaseRequestModel())->where('branch_id', $branchId)->where('status', 'pending')->countAllResults();
                $data['active_alerts'] = (new StockAlertModel())->where('branch_id', $branchId)->where('status', 'active')->countAllResults();

                // Additional metrics for branch manager
                $data['pending_transfers'] = (new TransferModel())->where('to_branch_id', $branchId)->where('status', 'pending')->countAllResults();
                $data['pending_approvals'] = (new TransferModel())->where('from_branch_id', $branchId)->where('status', 'pending')->countAllResults();
                $data['in_transit_deliveries'] = (new DeliveryModel())->where('branch_id', $branchId)->where('status', 'in_transit')->countAllResults();
                $data['scheduled_deliveries'] = (new DeliveryModel())->where('branch_id', $branchId)->where('status', 'scheduled')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `purchase_requests`
WHERE `branch_id` = '4'
AND `status` = 'pending'
SELECT COUNT(*) AS `numrows`
FROM `stock_alerts`
WHERE `branch_id` = '4'
AND `status` = 'active'
SELECT COUNT(*) AS `numrows`
FROM `transfers`
WHERE `to_branch_id` = '4'
AND `status` = 'pending'
SELECT COUNT(*) AS `numrows`
FROM `transfers`
WHERE `from_branch_id` = '4'
AND `status` = 'pending'
SELECT COUNT(*) AS `numrows`
FROM `deliveries`
WHERE `branch_id` = '4'
AND `status` = 'in_transit'
SELECT COUNT(*) AS `numrows`
FROM `deliveries`
WHERE `branch_id` = '4'
AND `status` = 'scheduled'

                $data['inventory_value'] = $this->getBranchInventoryValue($branchId);

                // Purchase orders for this branch
                $data['pending_orders'] = (new PurchaseOrderModel())->where('branch_id', $branchId)->whereIn('status', ['draft', 'sent'])->countAllResults();
                $data['completed_orders'] = (new PurchaseOrderModel())->where('branch_id', $branchId)->where('status', 'completed')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `purchase_orders`
WHERE `branch_id` = '4'
AND `status` IN ('draft','sent')
SELECT COUNT(*) AS `numrows`
FROM `purchase_orders`
WHERE `branch_id` = '4'
AND `status` = 'completed'

                $this->sendLowStockNotifications($branchId, $lowStockItems);

                // Recent activities
                $data['recent_requests'] = (new PurchaseRequestModel())->where('branch_id', $branchId)->orderBy('created_at', 'DESC')->limit(5)->findAll();
                $transferModel = new TransferModel();
                $data['recent_transfers'] = $transferModel->groupStart()
                    ->where('from_branch_id', $branchId)
                    ->orWhere('to_branch_id', $branchId)
                    ->groupEnd()
                    ->orderBy('created_at', 'DESC')
                    ->limit(5)
                    ->findAll();
                $data['recent_deliveries'] = (new DeliveryModel())->where('branch_id', $branchId)->orderBy('created_at', 'DESC')->limit(5)->findAll();
---
SELECT *
FROM `purchase_requests`
WHERE `branch_id` = '4'
ORDER BY `created_at` DESC
 LIMIT 5
SELECT *
FROM `transfers`
WHERE   (
`from_branch_id` = '4'
OR `to_branch_id` = '4'
 )
ORDER BY `created_at` DESC
 LIMIT 5
SELECT *
FROM `deliveries`
WHERE `branch_id` = '4'
ORDER BY `created_at` DESC
 LIMIT 5

    private function getLowStockItems($branchId)
    {
        $inventoryModel = new InventoryModel();

        $lowStock = $inventoryModel->select('inventory.*, products.name as product_name, products.sku, products.min_stock_level')
            ->join('products', 'products.id = inventory.product_id')
            ->where('inventory.branch_id', $branchId)
            ->where('inventory.quantity <= products.min_stock_level', null, false)
            ->where('inventory.quantity >', 0) // Exclude out of stock
            ->orderBy('inventory.quantity', 'ASC')
            ->findAll();
---
SELECT `inventory`.*, `products`.`name` as `product_name`, `products`.`sku`, `products`.`min_stock_level`
FROM `inventory`
JOIN `products` ON `products`.`id` = `inventory`.`product_id`
WHERE `inventory`.`branch_id` = '4'
AND inventory.quantity <= products.min_stock_level
AND `inventory`.`quantity` > 0
ORDER BY `inventory`.`quantity` ASC

    private function getBranchInventoryValue($branchId)
    {
        $inventoryModel = new InventoryModel();
        $productModel = new ProductModel();

        $inventoryItems = $inventoryModel->select('inventory.quantity, products.cost_price')
            ->join('products', 'products.id = inventory.product_id')
            ->where('inventory.branch_id', $branchId)
            ->findAll();
---
SELECT `inventory`.`quantity`, `products`.`cost_price`
FROM `inventory`
JOIN `products` ON `products`.`id` = `inventory`.`product_id`
WHERE `inventory`.`branch_id` = '4'

    private function getBranchPurchaseRequestsChartData($branchId)
    {
        $purchaseRequestModel = new PurchaseRequestModel();

        // Get last 7 days of purchase requests
        $data = [];
        $labels = [];
        for ($i = 6; $i >= 0; $i--) {
            $date = date('Y-m-d', strtotime("-$i days"));
            $labels[] = date('M d', strtotime($date));
            $count = $purchaseRequestModel->where('branch_id', $branchId)
                ->where('created_at >=', $date . ' 00:00:00')
                ->where('created_at <=', $date . ' 23:59:59')
                ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `purchase_requests`
WHERE `branch_id` = '4'
AND `created_at` >= '2025-12-09 00:00:00'
AND `created_at` <= '2025-12-09 23:59:59'

    private function getBranchInventoryTrendsChartData($branchId)
    {
        $inventoryModel = new InventoryModel();

        // Get current inventory count for last 7 days (simplified - showing current inventory)
        // For a more accurate trend, we'd need to track daily snapshots
        $data = [];
        $labels = [];
        $currentCount = $inventoryModel->where('branch_id', $branchId)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `inventory`
WHERE `branch_id` = '4'

    private function getBranchTransfersChartData($branchId)
    {
        $transferModel = new TransferModel();

        $statuses = ['pending', 'approved', 'completed', 'rejected'];
        $data = [];
        $labels = [];

        foreach ($statuses as $status) {
            $count = $transferModel->groupStart()
                ->where('from_branch_id', $branchId)
                ->orWhere('to_branch_id', $branchId)
                ->groupEnd()
                ->where('status', $status)
                ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `transfers`
WHERE   (
`from_branch_id` = '4'
OR `to_branch_id` = '4'
 )
AND `status` = 'pending'