app/Controllers/FranchiseApplicationController.php

    public function reject($id)
    {
        $session = session();
        if (!$session->get('isLoggedIn')) {
            return redirect()->to('/login');
        }

        $role = $session->get('role');
        if ($role !== 'central_admin') {
            return redirect()->to('/dashboard')->with('error', 'Unauthorized access');
        }

        $application = $this->db->table('franchise_applications')
            ->where('id', $id)
            ->get()
            ->getRowArray();

        if (!$application) {
            return redirect()->to('franchise-applications')->with('error', 'Application not found');
        }

        // Update status
        $this->db->table('franchise_applications')
            ->where('id', $id)
            ->update([
                'status' => 'rejected',
                'updated_at' => date('Y-m-d H:i:s')
            ]);
---
SELECT *
FROM `franchise_applications`
WHERE `id` = '7'
UPDATE `franchise_applications` SET `status` = 'rejected', `updated_at` = '2025-12-08 15:02:14'
WHERE `id` = '7'

        $this->sendApplicationStatusEmail($application['email'], $application['full_name'], 'rejected');

        // Log activity
        $this->activityLogModel->insert([
            'user_id' => $session->get('user_id'),
            'action' => 'reject',
            'module' => 'franchise_application',
            'description' => "Rejected franchise application from {$application['full_name']}",
            'created_at' => date('Y-m-d H:i:s')
        ]);
---
INSERT INTO `activity_logs` (`user_id`, `action`, `module`, `description`, `created_at`) VALUES ('1', 'reject', 'franchise_application', 'Rejected franchise application from Mansor Malik', '2025-12-08 15:02:18')