app/Controllers/Home.php


            // Check if franchise_applications table exists
            if ($db->tableExists('franchise_applications')) {
                $db->table('franchise_applications')->insert($data);
---
INSERT INTO `franchise_applications` (`full_name`, `email`, `phone_number`, `address`, `status`, `created_at`) VALUES ('Mansor Malik', 'mansormalik121422@gmail.com', '+639068736392', 'General Santos City', 'pending', '2025-12-08 15:01:45')