app/Controllers/InventoryController.php

    public function index()
    {
        $session = session();
        if (!$session->get('isLoggedIn')) {
            return redirect()->to('/login');
        }

        $branchId = $this->request->getGet('branch_id');
        // If branch_id is empty string from query, treat as null (show all)
        if ($branchId === '') {
            $branchId = null;
        }
        // If no branch_id in query and user is not admin, use their branch
        if ($branchId === null && $session->get('role') !== 'central_admin' && $session->get('role') !== 'system_admin') {
            $branchId = $session->get('branch_id');
        }

        $role = $session->get('role');

        // Get inventory with product details, include branch name when showing all branches
        if ($branchId === null) {
            $builder = $this->inventoryModel->select('inventory.*, products.name as product_name, products.sku, products.barcode, products.unit, products.min_stock_level, products.is_perishable, branches.name as branch_name')
                ->join('products', 'products.id = inventory.product_id')
                ->join('branches', 'branches.id = inventory.branch_id', 'left');
        } else {
            $builder = $this->inventoryModel->select('inventory.*, products.name as product_name, products.sku, products.barcode, products.unit, products.min_stock_level, products.is_perishable')
                ->join('products', 'products.id = inventory.product_id');
            $builder->where('inventory.branch_id', $branchId);
        }

        $data['inventory'] = $builder->findAll();
        $data['branches'] = $this->branchModel->where('status', 'active')->findAll();
---
SELECT `inventory`.*, `products`.`name` as `product_name`, `products`.`sku`, `products`.`barcode`, `products`.`unit`, `products`.`min_stock_level`, `products`.`is_perishable`, `branches`.`name` as `branch_name`
FROM `inventory`
JOIN `products` ON `products`.`id` = `inventory`.`product_id`
LEFT JOIN `branches` ON `branches`.`id` = `inventory`.`branch_id`
SELECT *
FROM `branches`
WHERE `status` = 'active'