app/Controllers/NotificationController.php

SELECT *
FROM `notifications`
WHERE `user_id` = '1'
ORDER BY `is_read` ASC, `created_at` DESC
 LIMIT 10
---
    public function getUnread()
    {
        $session = session();
        if (!$session->get('isLoggedIn')) {
            return $this->response->setJSON(['notifications' => []]);
        }

        // Get recent notifications (both read and unread for display)
        // Order by: unread first, then by created_at DESC (newest first)
        $notifications = $this->notificationModel->where('user_id', $session->get('user_id'))
            ->orderBy('is_read', 'ASC')  // Unread (0) before read (1)
            ->orderBy('created_at', 'DESC')  // Then newest first
            ->limit(10)
            ->findAll();