app/Controllers/ProductController.php

SELECT *
FROM `products`
ORDER BY `created_at` DESC
---
    public function index()
    {
        $session = session();
        if (!$session->get('isLoggedIn')) {
            return redirect()->to('/login');
        }

        $data['products'] = $this->productModel->orderBy('created_at', 'DESC')->findAll();