app/Controllers/PurchaseOrderController.php

SELECT `purchase_orders`.*, `suppliers`.`name` as `supplier_name`, `branches`.`name` as `branch_name`, `users`.`full_name` as `created_by_name`
FROM `purchase_orders`
JOIN `suppliers` ON `suppliers`.`id` = `purchase_orders`.`supplier_id`
JOIN `branches` ON `branches`.`id` = `purchase_orders`.`branch_id`
JOIN `users` ON `users`.`id` = `purchase_orders`.`created_by`
ORDER BY `purchase_orders`.`created_at` DESC
---
    public function index()
    {
        $session = session();
        if (!$session->get('isLoggedIn')) {
            return redirect()->to('/login');
        }

        $role = $session->get('role');
        $branchId = $session->get('branch_id');
        $supplierId = $session->get('supplier_id');

        // For supplier role, ensure we have supplier_id
        if ($role === 'supplier' && !$supplierId) {
            // Try to get supplier_id from user record
            $userModel = new \App\Models\UserModel();
            $user = $userModel->find($session->get('user_id'));
            if ($user && !empty($user['supplier_id'])) {
                $supplierId = $user['supplier_id'];
                // Update session for future requests
                $session->set('supplier_id', $supplierId);
            }
        }

        $builder = $this->purchaseOrderModel->select('purchase_orders.*, suppliers.name as supplier_name, branches.name as branch_name, users.full_name as created_by_name')
            ->join('suppliers', 'suppliers.id = purchase_orders.supplier_id')
            ->join('branches', 'branches.id = purchase_orders.branch_id')
            ->join('users', 'users.id = purchase_orders.created_by')
            ->orderBy('purchase_orders.created_at', 'DESC');

SELECT `purchase_requests`.*, `branches`.`name` as `branch_name`
FROM `purchase_requests`
JOIN `branches` ON `branches`.`id` = `purchase_requests`.`branch_id`
WHERE `purchase_requests`.`status` = 'approved'
AND purchase_requests.id NOT IN (SELECT purchase_request_id FROM purchase_orders WHERE purchase_request_id IS NOT NULL)
SELECT `users`.*, `suppliers`.`id` as `supplier_id`, `suppliers`.`name` as `supplier_name`
FROM `users`
JOIN `suppliers` ON `suppliers`.`id` = `users`.`supplier_id`
WHERE `users`.`role` = 'supplier'
AND `users`.`status` = 'active'
AND `users`.`supplier_id` IS NOT NULL
AND `users`.`deleted_at` IS NULL
SELECT *
FROM `branches`
WHERE `status` = 'active'
SELECT *
FROM `products`
WHERE `status` = 'active'
---
        $data['role'] = $role;

        // Data for Create PO Modal
        $data['approved_requests'] = $this->purchaseRequestModel->select('purchase_requests.*, branches.name as branch_name')
            ->join('branches', 'branches.id = purchase_requests.branch_id')
            ->where('purchase_requests.status', 'approved')
            ->where('purchase_requests.id NOT IN (SELECT purchase_request_id FROM purchase_orders WHERE purchase_request_id IS NOT NULL)', null, false)
            ->findAll();
        // Get supplier users with their supplier_id (display username in dropdown)
        $userModel = new \App\Models\UserModel();
        $data['suppliers'] = $userModel->select('users.*, suppliers.id as supplier_id, suppliers.name as supplier_name')
            ->join('suppliers', 'suppliers.id = users.supplier_id')
            ->where('users.role', 'supplier')
            ->where('users.status', 'active')
            ->where('users.supplier_id IS NOT NULL')
            ->findAll();
        $data['branches'] = $this->branchModel->where('status', 'active')->findAll();
        $data['allProducts'] = $this->productModel->where('status', 'active')->findAll();