app/Controllers/SupplierController.php

SELECT *
FROM `suppliers`
ORDER BY `created_at` DESC
---
    public function index()
    {
        $session = session();
        if (!$session->get('isLoggedIn')) {
            return redirect()->to('/login');
        }

        $builder = $this->supplierModel;

        // Search functionality
        $search = $this->request->getGet('search');
        if ($search) {
            $builder->groupStart()
                ->like('name', $search)
                ->orLike('code', $search)
                ->orLike('contact_person', $search)
                ->orLike('email', $search)
                ->groupEnd();
        }

        // Filter by status
        $status = $this->request->getGet('status');
        if ($status) {
            $builder->where('status', $status);
        }

        $data['suppliers'] = $builder->orderBy('created_at', 'DESC')->findAll();