app/Controllers/TransferController.php

    public function index()
    {
        $session = session();
        if (!$session->get('isLoggedIn')) {
            return redirect()->to('/login');
        }

        $role = $session->get('role');
        $branchId = $session->get('branch_id');

        $builder = $this->transferModel->select('transfers.*,
            from_branch.name as from_branch_name,
            to_branch.name as to_branch_name,
            requester.full_name as requested_by_name,
            approver.full_name as approved_by_name')
            ->join('branches as from_branch', 'from_branch.id = transfers.from_branch_id')
            ->join('branches as to_branch', 'to_branch.id = transfers.to_branch_id')
            ->join('users as requester', 'requester.id = transfers.requested_by')
            ->join('users as approver', 'approver.id = transfers.approved_by', 'left')
            ->orderBy('transfers.created_at', 'DESC');

        if ($branchId && $role !== 'central_admin' && $role !== 'central_admin') {
            $builder->where('transfers.from_branch_id', $branchId)
                ->orWhere('transfers.to_branch_id', $branchId);
        }

        $data['transfers'] = $builder->findAll();
---
SELECT `transfers`.*, `from_branch`.`name` as `from_branch_name`, `to_branch`.`name` as `to_branch_name`, `requester`.`full_name` as `requested_by_name`, `approver`.`full_name` as `approved_by_name`
FROM `transfers`
JOIN `branches` as `from_branch` ON `from_branch`.`id` = `transfers`.`from_branch_id`
JOIN `branches` as `to_branch` ON `to_branch`.`id` = `transfers`.`to_branch_id`
JOIN `users` as `requester` ON `requester`.`id` = `transfers`.`requested_by`
LEFT JOIN `users` as `approver` ON `approver`.`id` = `transfers`.`approved_by`
ORDER BY `transfers`.`created_at` DESC

    public function view($id)
    {
        $session = session();
        if (!$session->get('isLoggedIn')) {
            return redirect()->to('/login');
        }

        $transfer = $this->transferModel->select('transfers.*,
            from_branch.name as from_branch_name,
            to_branch.name as to_branch_name,
            requester.full_name as requested_by_name,
            approver.full_name as approved_by_name')
            ->join('branches as from_branch', 'from_branch.id = transfers.from_branch_id')
            ->join('branches as to_branch', 'to_branch.id = transfers.to_branch_id')
            ->join('users as requester', 'requester.id = transfers.requested_by')
            ->join('users as approver', 'approver.id = transfers.approved_by', 'left')
            ->find($id);

        if (!$transfer) {
            return redirect()->to('/transfers')->with('error', 'Transfer not found');
        }

        $items = $this->transferItemModel->select('transfer_items.*, products.name as product_name, products.sku, products.unit')
            ->join('products', 'products.id = transfer_items.product_id')
            ->where('transfer_items.transfer_id', $id)
            ->findAll();

        $data['transfer'] = $transfer;
        $data['items'] = $items;
        $data['role'] = $session->get('role');
---
SELECT *
FROM `transfers`
WHERE `transfers`.`id` = '1'

    public function approve($id)
    {
        $session = session();
        if (!$session->get('isLoggedIn')) {
            return redirect()->to('/login');
        }

        $role = $session->get('role');
        if ($role !== 'branch_manager' && $role !== 'central_admin' && $role !== 'central_admin') {
            return redirect()->back()->with('error', 'Unauthorized');
        }

        $transfer = $this->transferModel->find($id);
        if (!$transfer || $transfer['status'] !== 'pending') {
            return redirect()->back()->with('error', 'Invalid transfer request');
        }

        $this->transferModel->update($id, [
            'status' => 'approved',
            'approved_by' => $session->get('user_id'),
            'approved_at' => date('Y-m-d H:i:s')
        ]);
---
UPDATE `transfers` SET `status` = 'approved', `approved_by` = '1', `approved_at` = '2025-11-17 18:55:40', `updated_at` = '2025-11-17 18:55:40'
WHERE `transfers`.`id` IN ('1')