app/Models/ActivityLogModel.php

    public function logActivity($userId, $action, $module, $description = null)
    {
        // Skip logging if user_id is null or invalid
        if (empty($userId)) {
            return false;
        }

        try {
            return $this->insert([
                'user_id' => $userId,
                'action' => $action,
                'module' => $module,
                'description' => $description,
                'ip_address' => $_SERVER['REMOTE_ADDR'] ?? null,
                'user_agent' => $_SERVER['HTTP_USER_AGENT'] ?? null,
                'created_at' => date('Y-m-d H:i:s')
            ]);
---
INSERT INTO `activity_logs` (`user_id`, `action`, `module`, `description`, `ip_address`, `user_agent`, `created_at`) VALUES ('1', 'approve', 'transfer', 'Approved transfer ID: 1', '::1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/141.0.0.0 Safari/537.36', '2025-11-17 18:55:40')