app/Models/NotificationModel.php

SELECT COUNT(*) AS `numrows`
FROM `notifications`
WHERE `user_id` = '1'
AND `is_read` = 0
---
    public function getUnreadCount($userId)
    {
        return $this->where('user_id', $userId)
            ->where('is_read', 0)
            ->countAllResults();

SELECT *
FROM `notifications`
WHERE `user_id` = '2'
AND `is_read` = 0
ORDER BY `created_at` DESC
 LIMIT 10
---
    public function getUnreadNotifications($userId, $limit = 10)
    {
        return $this->where('user_id', $userId)
            ->where('is_read', 0)
            ->orderBy('created_at', 'DESC')
            ->limit($limit)
            ->findAll();